{
    "ifrs15":[
        {
            "id": 1,
            "number":16,
            "title": "第15條: 若依第 20 段之規定，合約之修改不視為一單獨合約處理，企業應以下列方式（視何者適用），處理合約修改日尚未移轉之已承諾商品或勞務（亦即，剩餘之已承諾商品或勞務）：(a)若剩餘之商品或勞務可與合約修改日以前已移轉之商品或勞務區分，企業應將該合約修改視為終止現有合約並產生新合約處理。分攤至尚未履行之履約義務（或依第 22 段(b)所辨認之單一履約義務中剩餘可區分商品或勞務）之對價金額為下列兩者之和：(i)已計入交易價格估計值中且尚未被認列為收入之客戶承諾對價（包括已自客戶收取之金額）；及(ii)\t作為合約修改之一部分之承諾對價。(b)\t若剩餘之商品或勞務係不可區分且因而成為於合約修改日已部分滿足之單一履約義務之一部分，企業應將該合約修改視為現有合約之一部分處理。合約修改對交易價格及企業對履約義務完成程度之衡量結果之影響，應於合約修改日認列為收入之調整（收入之增加或減少），亦即，收入之調整係以累積追計為基礎。(c)若剩餘之商品或勞務係項目(a)及(b)之組合，則企業應以與本段之目的一致之方式，處理該修改對修改後之合約中未滿足（包括部分未滿足）之履約義務之影響。"
        },
        {
            "id": 2,
            "number":11,
            "title": "第84條: 企業應依第 18 至 21 段之規定處理因合約修改所產生之交易價格變動。惟對於合約修改後所產生之交易價格變動，企業應以下列方式（視何者適用）適用第 87 至89 段以分攤交易價格之變動：(a)若交易價格變動可歸屬於合約修改前之承諾變動對價金額，且該修改係依第21 段(a)之規定處理，則企業應於該可歸屬範圍內，將交易價格之變動分攤至合約修改前所辨認之合約中履約義務。(b)當合約修改非依第 20 段規定之單獨合約處理且非屬(a)時，企業應將交易價格之變動分攤至已修改合約之履約義務（即修改後當時尚未滿足或部分未滿足之履約義務）。"
        },
        {
            "id": 3,
            "number":9,
            "title": "第79條: 若同時符合下列兩條件，企業應將變動金額（及其後續變動）完全分攤至一履約義務，或一可區分商品或勞務（構成第 22 段(b)之單一履約義務之一部分）：(a)變動付款之條件與企業為滿足履約義務或移轉可區分商品或勞務之投入（或滿足履約義務或移轉可區分商品或勞務之特定結果）明確相關；及(b)\t考量合約之所有履約義務及付款條件時，將對價之變動金額完全分攤至履約義務或可區分商品或勞務係與第 73 段之分攤目的一致。', '12.合約修改係合約各方所核准之合約範圍或價格（或兩者）變動。於某些產業及轄區，合約修改可能被稱為訂單更改、合約變更或合約修正。當合約之各方核准修改而產生新的或改變既有可執行之權利及義務，則存在合約修改。合約修改可能以書面、口頭協議或隱含之商業實務慣例之方式核准。若合約之各方尚未核准合約之修改，企業應持續適用本準則於現有合約，直至該合約修改被核准。"

        },
        {
            "id": 4,
            "number":8,
            "title": "第32: 若履約義務依第 35 至 37 段之規定並非隨時間逐步滿足，企業係於某一時點滿足該履約義務。為判定客戶對所承諾資產取得控制且企業滿足履約義務之時點，企業應考量第 31 至 34 段對控制之規定。此外，企業應考量控制移轉之指標包括（但不限於）下列各項：(a)企業對該資產之款項有現時之權利─若客戶對資產有付款之現時義務，則可能顯示客戶已具有能力以主導資產之使用並取得該資產之幾乎所有剩餘效益。(b)客戶對該資產有法定所有權─法定所有權可能顯示合約之某一方具有能力以主導該資產之使用並取得該資產之幾乎所有剩餘效益，或有使其他企業無法取得該等效益之能力。因此，資產法定所有權之移轉可能顯示客戶已取得對該資產之控制。若企業保留法定所有權僅作為客戶無法付款之保障，企業之該等權利並未排除客戶取得對資產之控制。(c)企業已移轉對該資產之實體持有─客戶持有資產之實體可能顯示客戶具有能力以主導該資產之使用並取得該資產之幾乎所有剩餘效益，或具有能力以使其他企業無法取得該等效益。惟實體之持有可能不等同於資產之控制。例如， 於某些再買回協議或寄銷協議中，客戶或承銷人可能持有企業所控制資產之實體。相反地，於某些開帳單並代管協議中，企業可能持有客戶所控制資產之實體。第 B64 至 B76 段、第 B77 至 B78 段及第 B79 至 B82 段分別提供再買回協議、寄銷協議及開帳單並代管協議會計處理之指引。(d)客戶具有該資產所有權之重大風險及報酬─移轉資產所有權之重大風險及報酬予客戶可能顯示客戶具有能力以主導該資產之使用及取得該資產之幾乎所有剩餘效益。惟於評估所承諾之資產所有權之風險及報酬時，企業應排除可能導致移轉資產履約義務外之單獨履約義務之任何風險。例如，企業可能已移轉對資產之控制予客戶，但尚未滿足提供與該已移轉資產相關維修服務之額外履約義務。(e)客戶已接受該資產─客戶對資產之接受可能顯示其已具有能力以主導該資產之使用並取得該資產之幾乎所有剩餘效益。於評估合約中客戶之接受條款對移轉資產控制時點之影響時，企業應考量第B83 至 B86 段之指引。"

        },
        {
            "id": 5,
            "number":6,
            "title": "第13條: 合約之各方對修改之範圍或價格（或兩者）有歧見，或各方已核准合約範圍之變動但尚未決定相應之價格變動，該合約之修改仍可能存在於此等情況下。判定合約修改所產生或改變之權利及義務是否係可執行時，企業應考量所有攸關事實及情況，包括合約條款與其他證據。若合約之各方已核准合約範圍之變動，但尚未決定相應之價格變動時，企業應依第 50 至 54 段（變動對價之估計）及第 56 至 58 段（限制變動對價估計值）之規定，估計由該修改所產生之交易價格變動。', '26.對依第 22 至 30 段之規定所辨認出之每一履約義務，企業應於合約開始時判定， 其究係將隨時間逐步滿足履約義務（依第 35 及 37 段之規定）抑或將於某一時點滿足履約義務（依第 38 段之規定）。若企業並非隨時間逐步滿足履約義務，該履約義務係於某一時點滿足。"

        }
    ]
}